src/cf/src/Catalogs/ОбъектыМетаданныхКонфигураций/ОбъектыМетаданныхКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданныхКонфигураций</name>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>CatalogRef.ТипОбъектаМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПротестирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененияПоУмолчанию</name>
    <attributes>
      <name>ТипМодуля</name>
      <type>
        <types>CatalogRef.ТипыМодулей</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформацияПоИзменениям</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторИзменений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ОбъектыМетаданныхКонфигураций/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		//Новый
		
		Объект.Актуальность = Истина;
		
		ЗаполнитьТипыМодулейПоУмолчанию();
		
	КонецЕсли;
	
	УстановитьКоличестваВЗаголовки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Обновить_СписокОбъектовМетаданных");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзмененияПоУмолчаниюПриИзменении(Элемент)
	
	УстановитьКоличестваВЗаголовки();

КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаМетаданныхПриИзменении(Элемент)
	
	ЗаполнитьТипыМодулейПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьКоличестваВЗаголовки()

	Элементы.ГруппаИзмененияПоУмолчанию.Заголовок = СтрШаблон(НСтр("ru = 'Изменения по умолчанию (%1)'"), Объект.ИзмененияПоУмолчанию.Количество()); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыМодулейПоУмолчанию() 
	
	Объект.ИзмененияПоУмолчанию.Очистить();
	
	Для каждого стр Из Объект.ТипОбъектаМетаданных.ТипыМодулейПоУмолчанию Цикл
		
		НовСтрИзм = Объект.ИзмененияПоУмолчанию.Добавить();
		НовСтрИзм.ТипМодуля = стр.ТипМодуля;
		
	КонецЦикла;
	
	УстановитьКоличестваВЗаголовки();
	
КонецПроцедуры

#КонецОбласти
